# Да се напише програма, която чете скорост (реално число), въведена от потребителя и отпечатва информация за скоростта.
speed=float(input())
# •	При скорост до 10 (включително) отпечатайте "slow"
if speed <=10:
    print("slow")
# •	При скорост над 10 и до 50 (включително) отпечатайте "average"
elif speed <=50:
    print("average")
# •	При скорост над 50 и до 150 (включително) отпечатайте "fast"
elif speed<=150:
    print("fast")
# •	При скорост над 150 и до 1000 (включително) отпечатайте "ultra fast"
elif speed<=1000:
    print("ultra fast")
# •	При по-висока скорост отпечатайте "extremely fast"
else:
    print("extremely fast")