# Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка.
# Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира,
# като знаете колко е таксата за тренировки по баскетбол за период от 1 година.
price_for_one_year=int(input())
# Нужна екипировка:
# •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година

sneakers=price_for_one_year-(price_for_one_year*0.40)
# •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
jerseys=sneakers-(sneakers*0.20)
# •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
basketball=jerseys*0.25
# •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
accessories=basketball*0.20
# Вход
# От конзолата се четe 1 ред:
# •	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
# Изход
# Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол
total_price_all=price_for_one_year+sneakers+jerseys+basketball+accessories
print(total_price_all)