# За рождения си ден Любомир получил аквариум с формата на паралелепипед.
# Първоначално прочитаме от конзолата на отделни редове размерите му – дължина, широчина и височина в сантиметри.
length_centimeters=int(input())
height_centimeters=int(input())
width_centimeters=int(input())
percentage_taken=float(input()) /100

volume_aquarium_centimeters=length_centimeters*height_centimeters*width_centimeters
volume_aquarium_liters=volume_aquarium_centimeters/1000

water_liters=1
# Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае,
water_needed=volume_aquarium_liters*(water_liters-percentage_taken)
print(water_needed)
# че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/.

# Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
# Вход
# От конзолата се четат 4 реда:
# 1.	Дължина в см – цяло число в интервала [10 … 500]
# 2.	Широчина в см – цяло число в интервала [10 … 300]
# 3.	Височина в см – цяло число в интервала [10… 200]
# 4.	Процент  – реално число в интервала [0.000 … 100.000]
# Изход
# Да се отпечата на конзолата едно число:
# •	литрите вода, които ще  събира аквариума.
